{"format": "graph-model", "generatedBy": "1.14.1-dev20190325", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "encoder/z_mean/BiasAdd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "200"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PlaceholderWithDefault_6/input", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "decoder/batch_normalization_3/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "decoder/batch_normalization_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "decoder/batch_normalization_2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "decoder/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "decoder/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3456"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "3456"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "2048"}]}}}}}, {"name": "decoder/conv2d_transpose/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decoder/conv2d_transpose_4/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "decoder/batch_normalization/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "192"}, {"size": "384"}]}}}}}, {"name": "decoder/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/batch_normalization_1/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "192"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "decoder/batch_normalization_2/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/batch_normalization_3/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "decoder/batch_normalization_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PlaceholderWithDefault_6", "op": "PlaceholderWithDefault", "input": ["PlaceholderWithDefault_6/input"], "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "decoder/dense/MatMul", "op": "MatMul", "input": ["encoder/z_mean/BiasAdd", "decoder/dense/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "decoder/batch_normalization/cond/Switch", "op": "Switch", "input": ["PlaceholderWithDefault_6", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["decoder/batch_normalization_3/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["decoder/batch_normalization_3/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["decoder/batch_normalization_2/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["decoder/batch_normalization_2/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["decoder/batch_normalization_1/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["decoder/batch_normalization_1/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["decoder/batch_normalization/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["decoder/batch_normalization/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["decoder/batch_normalization/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["decoder/batch_normalization/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["decoder/batch_normalization_1/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["decoder/batch_normalization_1/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["decoder/batch_normalization_2/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["decoder/batch_normalization_2/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["decoder/batch_normalization_3/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["decoder/batch_normalization_3/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense/BiasAdd", "op": "BiasAdd", "input": ["decoder/dense/MatMul", "decoder/dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/batch_normalization/cond/switch_t", "op": "Identity", "input": ["decoder/batch_normalization/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "decoder/dense/Relu", "op": "Relu", "input": ["decoder/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/Const", "op": "Const", "input": ["^decoder/batch_normalization/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/MatMul", "op": "MatMul", "input": ["decoder/dense/Relu", "decoder/dense_1/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/BiasAdd", "op": "BiasAdd", "input": ["decoder/dense_1/MatMul", "decoder/dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/dense_1/Relu", "op": "Relu", "input": ["decoder/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Reshape", "op": "Reshape", "input": ["decoder/dense_1/Relu", "decoder/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/Shape", "op": "Shape", "input": ["decoder/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/mul", "op": "Mul", "input": ["decoder/conv2d_transpose/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/stack", "op": "Pack", "input": ["decoder/conv2d_transpose/strided_slice", "decoder/conv2d_transpose/mul", "decoder/conv2d_transpose/mul_1", "decoder/conv2d_transpose/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "decoder/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose/stack", "decoder/conv2d_transpose/kernel", "decoder/Reshape"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "decoder/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose/conv2d_transpose", "decoder/conv2d_transpose/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["decoder/conv2d_transpose/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization/cond/FusedBatchNorm_1/Switch:1", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1:1", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2:1", "decoder/batch_normalization/cond/Const", "decoder/batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "decoder/batch_normalization/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization/cond/FusedBatchNorm_1/Switch", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_3", "decoder/batch_normalization/cond/FusedBatchNorm_1/Switch_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization/cond/Merge", "op": "Merge", "input": ["decoder/batch_normalization/cond/FusedBatchNorm_1", "decoder/batch_normalization/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "decoder/Relu", "op": "Relu", "input": ["decoder/batch_normalization/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_1/Shape", "op": "Shape", "input": ["decoder/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_1/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_1/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_1/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_1/strided_slice", "decoder/conv2d_transpose_1/mul", "decoder/conv2d_transpose_1/mul_1", "decoder/conv2d_transpose_2/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_1/stack", "decoder/conv2d_transpose_1/kernel", "decoder/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "decoder/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_1/conv2d_transpose", "decoder/conv2d_transpose_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["decoder/conv2d_transpose_1/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch:1", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1:1", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2:1", "decoder/batch_normalization/cond/Const", "decoder/batch_normalization/cond/Const"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_1/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "decoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "decoder/batch_normalization_1/cond/Merge", "op": "Merge", "input": ["decoder/batch_normalization_1/cond/FusedBatchNorm_1", "decoder/batch_normalization_1/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "decoder/Relu_1", "op": "Relu", "input": ["decoder/batch_normalization_1/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/Shape", "op": "Shape", "input": ["decoder/Relu_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_2/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_2/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_2/strided_slice", "decoder/conv2d_transpose_2/mul", "decoder/conv2d_transpose_2/mul_1", "decoder/conv2d_transpose_2/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_2/stack", "decoder/conv2d_transpose_2/kernel", "decoder/Relu_1"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_2/conv2d_transpose", "decoder/conv2d_transpose_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["decoder/conv2d_transpose_2/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch:1", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1:1", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2:1", "decoder/batch_normalization/cond/Const", "decoder/batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "decoder/batch_normalization_2/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "decoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "decoder/batch_normalization_2/cond/Merge", "op": "Merge", "input": ["decoder/batch_normalization_2/cond/FusedBatchNorm_1", "decoder/batch_normalization_2/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "decoder/Relu_2", "op": "Relu", "input": ["decoder/batch_normalization_2/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/Shape", "op": "Shape", "input": ["decoder/Relu_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_3/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_3/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_3/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_3/strided_slice", "decoder/conv2d_transpose_3/mul", "decoder/conv2d_transpose_3/mul_1", "decoder/conv2d_transpose_3/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_3/stack", "decoder/conv2d_transpose_3/kernel", "decoder/Relu_2"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "decoder/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_3/conv2d_transpose", "decoder/conv2d_transpose_3/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["decoder/conv2d_transpose_3/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch:1", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1:1", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2:1", "decoder/batch_normalization/cond/Const", "decoder/batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "decoder/batch_normalization_3/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "decoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "decoder/batch_normalization_3/cond/Merge", "op": "Merge", "input": ["decoder/batch_normalization_3/cond/FusedBatchNorm_1", "decoder/batch_normalization_3/cond/FusedBatchNorm"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Relu_3", "op": "Relu", "input": ["decoder/batch_normalization_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/Shape", "op": "Shape", "input": ["decoder/Relu_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_4/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_4/mul/y", "decoder/conv2d_transpose_4/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_4/mul/y", "decoder/conv2d_transpose_4/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_4/strided_slice", "decoder/conv2d_transpose_4/mul", "decoder/conv2d_transpose_4/mul_1", "decoder/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "decoder/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_4/stack", "decoder/conv2d_transpose_4/kernel", "decoder/Relu_3"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "decoder/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_4/conv2d_transpose", "decoder/conv2d_transpose_4/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/conv2d_transpose_4/Sigmoid", "op": "Sigmoid", "input": ["decoder/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/flatten/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose_4/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/flatten/strided_slice", "op": "StridedSlice", "input": ["decoder/flatten/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/flatten/Reshape/shape", "op": "Pack", "input": ["decoder/flatten/strided_slice", "decoder/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "decoder/flatten/Reshape", "op": "Reshape", "input": ["decoder/conv2d_transpose_4/Sigmoid", "decoder/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 59}}, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "decoder/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/bias", "shape": [3], "dtype": "float32"}, {"name": "PlaceholderWithDefault_6/input", "shape": [], "dtype": "bool"}, {"name": "decoder/batch_normalization_3/beta", "shape": [96], "dtype": "float32"}, {"name": "decoder/batch_normalization_3/gamma", "shape": [96], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/bias", "shape": [96], "dtype": "float32"}, {"name": "decoder/batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_2/bias", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization_1/beta", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_1/bias", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization/beta", "shape": [384], "dtype": "float32"}, {"name": "decoder/batch_normalization/gamma", "shape": [384], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/bias", "shape": [384], "dtype": "float32"}, {"name": "decoder/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "decoder/dense_1/bias", "shape": [3456], "dtype": "float32"}, {"name": "decoder/dense_1/kernel", "shape": [2048, 3456], "dtype": "float32"}, {"name": "decoder/dense/bias", "shape": [2048], "dtype": "float32"}, {"name": "decoder/dense/kernel", "shape": [200, 2048], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/kernel", "shape": [5, 5, 384, 384], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/mul/y", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/batch_normalization/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "decoder/batch_normalization/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_1/kernel", "shape": [5, 5, 192, 384], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/batch_normalization_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_2/kernel", "shape": [5, 5, 192, 192], "dtype": "float32"}, {"name": "decoder/batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "decoder/batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/kernel", "shape": [5, 5, 96, 192], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/batch_normalization_3/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "decoder/batch_normalization_3/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_4/kernel", "shape": [5, 5, 3, 96], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/batch_normalization/cond/Const", "shape": [0], "dtype": "float32"}]}]}