{"format": "graph-model", "generatedBy": "1.14.1-dev20190325", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "encoder/z_mean/BiasAdd", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "decoder/flatten/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}, {"size": "1152"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}, {"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decoder/conv2d_transpose_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decoder/conv2d_transpose_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/dense/MatMul", "op": "MatMul", "input": ["encoder/z_mean/BiasAdd", "decoder/dense/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "decoder/dense/BiasAdd", "op": "BiasAdd", "input": ["decoder/dense/MatMul", "decoder/dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/dense/Relu", "op": "Relu", "input": ["decoder/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_1/MatMul", "op": "MatMul", "input": ["decoder/dense/Relu", "decoder/dense_1/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "decoder/dense_1/BiasAdd", "op": "BiasAdd", "input": ["decoder/dense_1/MatMul", "decoder/dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/dense_1/Relu", "op": "Relu", "input": ["decoder/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_2/MatMul", "op": "MatMul", "input": ["decoder/dense_1/Relu", "decoder/dense_2/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_2/BiasAdd", "op": "BiasAdd", "input": ["decoder/dense_2/MatMul", "decoder/dense_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/dense_2/Relu", "op": "Relu", "input": ["decoder/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Reshape", "op": "Reshape", "input": ["decoder/dense_2/Relu", "decoder/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/Shape", "op": "Shape", "input": ["decoder/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/mul", "op": "Mul", "input": ["decoder/conv2d_transpose/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose/stack", "op": "Pack", "input": ["decoder/conv2d_transpose/strided_slice", "decoder/conv2d_transpose/mul", "decoder/conv2d_transpose/mul_1", "decoder/conv2d_transpose/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "decoder/conv2d_transpose/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose/stack", "decoder/conv2d_transpose/kernel", "decoder/Reshape"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "decoder/conv2d_transpose/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose/conv2d_transpose", "decoder/conv2d_transpose/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/conv2d_transpose/Relu", "op": "Relu", "input": ["decoder/conv2d_transpose/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_1/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_1/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_1/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_1/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_1/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_1/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_1/strided_slice", "decoder/conv2d_transpose_1/mul", "decoder/conv2d_transpose_1/mul_1", "decoder/conv2d_transpose_2/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "decoder/conv2d_transpose_1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_1/stack", "decoder/conv2d_transpose_1/kernel", "decoder/conv2d_transpose/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "decoder/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_1/conv2d_transpose", "decoder/conv2d_transpose_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/conv2d_transpose_1/Relu", "op": "Relu", "input": ["decoder/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_2/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_2/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_2/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_2/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_2/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_2/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_2/strided_slice", "decoder/conv2d_transpose_2/mul", "decoder/conv2d_transpose_2/mul_1", "decoder/conv2d_transpose_2/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "decoder/conv2d_transpose_2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_2/stack", "decoder/conv2d_transpose_2/kernel", "decoder/conv2d_transpose_1/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "decoder/conv2d_transpose_2/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_2/conv2d_transpose", "decoder/conv2d_transpose_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/conv2d_transpose_2/Relu", "op": "Relu", "input": ["decoder/conv2d_transpose_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_3/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "decoder/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_3/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "decoder/conv2d_transpose_3/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_3/strided_slice_2", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_3/strided_slice_1", "decoder/conv2d_transpose_4/mul/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_3/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_3/strided_slice", "decoder/conv2d_transpose_3/mul", "decoder/conv2d_transpose_3/mul_1", "decoder/conv2d_transpose_3/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "decoder/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_3/stack", "decoder/conv2d_transpose_3/kernel", "decoder/conv2d_transpose_2/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "decoder/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_3/conv2d_transpose", "decoder/conv2d_transpose_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "decoder/conv2d_transpose_3/Relu", "op": "Relu", "input": ["decoder/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose_3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_2", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice_1", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["decoder/conv2d_transpose_4/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "decoder/conv2d_transpose_4/mul_1", "op": "Mul", "input": ["decoder/conv2d_transpose_4/mul/y", "decoder/conv2d_transpose_4/strided_slice_2"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/mul", "op": "Mul", "input": ["decoder/conv2d_transpose_4/mul/y", "decoder/conv2d_transpose_4/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "decoder/conv2d_transpose_4/stack", "op": "Pack", "input": ["decoder/conv2d_transpose_4/strided_slice", "decoder/conv2d_transpose_4/mul", "decoder/conv2d_transpose_4/mul_1", "decoder/conv2d_transpose_4/stack/3"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "decoder/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["decoder/conv2d_transpose_4/stack", "decoder/conv2d_transpose_4/kernel", "decoder/conv2d_transpose_3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["decoder/conv2d_transpose_4/conv2d_transpose", "decoder/conv2d_transpose_4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/conv2d_transpose_4/Sigmoid", "op": "Sigmoid", "input": ["decoder/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/flatten/Shape", "op": "Shape", "input": ["decoder/conv2d_transpose_4/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "decoder/flatten/strided_slice", "op": "StridedSlice", "input": ["decoder/flatten/Shape", "decoder/conv2d_transpose_4/strided_slice/stack", "decoder/conv2d_transpose_4/strided_slice/stack_1", "decoder/conv2d_transpose_4/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "decoder/flatten/Reshape/shape", "op": "Pack", "input": ["decoder/flatten/strided_slice", "decoder/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "decoder/flatten/Reshape", "op": "Reshape", "input": ["decoder/conv2d_transpose_4/Sigmoid", "decoder/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}], "library": {}, "versions": {"producer": 59}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "decoder/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/bias", "shape": [3], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/bias", "shape": [32], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_2/bias", "shape": [64], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_1/bias", "shape": [64], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/bias", "shape": [128], "dtype": "float32"}, {"name": "decoder/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "decoder/dense_2/bias", "shape": [1152], "dtype": "float32"}, {"name": "decoder/dense_2/kernel", "shape": [786, 1152], "dtype": "float32"}, {"name": "decoder/dense_1/bias", "shape": [786], "dtype": "float32"}, {"name": "decoder/dense_1/kernel", "shape": [786, 786], "dtype": "float32"}, {"name": "decoder/dense/bias", "shape": [786], "dtype": "float32"}, {"name": "decoder/dense/kernel", "shape": [256, 786], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/kernel", "shape": [5, 5, 128, 128], "dtype": "float32"}, {"name": "decoder/conv2d_transpose/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/mul/y", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice_2/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_1/kernel", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_2/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_2/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/kernel", "shape": [5, 5, 32, 64], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "decoder/conv2d_transpose_4/kernel", "shape": [5, 5, 3, 32], "dtype": "float32"}, {"name": "decoder/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}]}]}