{"format": "graph-model", "generatedBy": "1.14.1-dev20190325", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "input_x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "27648"}]}}}}, {"name": "gmm/gmm_means/read", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/z_mean/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/z_mean/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}, {"size": "256"}]}}}}}, {"name": "encoder/dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}, {"size": "786"}]}}}}}, {"name": "encoder/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1152"}, {"size": "786"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/conv2d_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "encoder/conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "encoder/conv2d/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "encoder/conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/Reshape", "op": "Reshape", "input": ["input_x", "encoder/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "encoder/conv2d/Conv2D", "op": "Conv2D", "input": ["encoder/Reshape", "encoder/conv2d/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "encoder/conv2d/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d/Conv2D", "encoder/conv2d/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/Relu", "op": "Relu", "input": ["encoder/conv2d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/Conv2D", "op": "Conv2D", "input": ["encoder/Relu", "encoder/conv2d_1/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "encoder/conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_1/Conv2D", "encoder/conv2d_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/Relu_1", "op": "Relu", "input": ["encoder/conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_2/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_1", "encoder/conv2d_2/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "encoder/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_2/Conv2D", "encoder/conv2d_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/Relu_2", "op": "Relu", "input": ["encoder/conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_3/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_2", "encoder/conv2d_3/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "encoder/conv2d_3/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_3/Conv2D", "encoder/conv2d_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/Relu_3", "op": "Relu", "input": ["encoder/conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_4/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_3", "encoder/conv2d_4/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "encoder/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_4/Conv2D", "encoder/conv2d_4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/Relu_4", "op": "Relu", "input": ["encoder/conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/flatten/Shape", "op": "Shape", "input": ["encoder/Relu_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice", "op": "StridedSlice", "input": ["encoder/flatten/Shape", "encoder/flatten/strided_slice/stack", "encoder/flatten/strided_slice/stack_1", "encoder/flatten/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/Reshape/shape", "op": "Pack", "input": ["encoder/flatten/strided_slice", "encoder/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "encoder/flatten/Reshape", "op": "Reshape", "input": ["encoder/Relu_4", "encoder/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "encoder/dense/MatMul", "op": "MatMul", "input": ["encoder/flatten/Reshape", "encoder/dense/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "encoder/dense/BiasAdd", "op": "BiasAdd", "input": ["encoder/dense/MatMul", "encoder/dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/dense/Relu", "op": "Relu", "input": ["encoder/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense_1/MatMul", "op": "MatMul", "input": ["encoder/dense/Relu", "encoder/dense_1/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense_1/BiasAdd", "op": "BiasAdd", "input": ["encoder/dense_1/MatMul", "encoder/dense_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/dense_1/Relu", "op": "Relu", "input": ["encoder/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/z_mean/MatMul", "op": "MatMul", "input": ["encoder/dense_1/Relu", "encoder/z_mean/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/z_mean/BiasAdd", "op": "BiasAdd", "input": ["encoder/z_mean/MatMul", "encoder/z_mean/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}], "library": {}, "versions": {"producer": 59}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "gmm/gmm_means/read", "shape": [4, 256], "dtype": "float32"}, {"name": "encoder/z_mean/bias", "shape": [256], "dtype": "float32"}, {"name": "encoder/z_mean/kernel", "shape": [786, 256], "dtype": "float32"}, {"name": "encoder/dense_1/bias", "shape": [786], "dtype": "float32"}, {"name": "encoder/dense_1/kernel", "shape": [786, 786], "dtype": "float32"}, {"name": "encoder/dense/bias", "shape": [786], "dtype": "float32"}, {"name": "encoder/dense/kernel", "shape": [1152, 786], "dtype": "float32"}, {"name": "encoder/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "encoder/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "encoder/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "encoder/conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "encoder/conv2d_4/kernel", "shape": [5, 5, 128, 128], "dtype": "float32"}, {"name": "encoder/conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "encoder/conv2d_3/kernel", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "encoder/conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder/conv2d_2/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "encoder/conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "encoder/conv2d_1/kernel", "shape": [5, 5, 32, 64], "dtype": "float32"}, {"name": "encoder/conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "encoder/conv2d/kernel", "shape": [5, 5, 3, 32], "dtype": "float32"}, {"name": "encoder/Reshape/shape", "shape": [4], "dtype": "int32"}]}]}