{"format": "graph-model", "generatedBy": "1.14.1-dev20190325", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "input_x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "27648"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "gmm/gmm_means/read", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "200"}]}}}}}, {"name": "encoder/z_mean/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "encoder/z_mean/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3456"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/flatten/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PlaceholderWithDefault_6/input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "encoder/batch_normalization_4/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "encoder/conv2d_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "encoder/conv2d_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "192"}, {"size": "384"}]}}}}}, {"name": "encoder/batch_normalization_2/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "encoder/batch_normalization_2/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "encoder/conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_2/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "192"}, {"size": "192"}]}}}}}, {"name": "encoder/batch_normalization_1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "96"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "encoder/conv2d/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "3"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "encoder/batch_normalization/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "encoder/batch_normalization_2/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "encoder/batch_normalization_3/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PlaceholderWithDefault_6", "op": "PlaceholderWithDefault", "input": ["PlaceholderWithDefault_6/input"], "attr": {"dtype": {"type": "DT_BOOL"}, "shape": {"shape": {}}}}, {"name": "encoder/Reshape", "op": "Reshape", "input": ["input_x", "encoder/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "encoder/batch_normalization/cond/Switch", "op": "Switch", "input": ["PlaceholderWithDefault_6", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["encoder/batch_normalization_4/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["encoder/batch_normalization_4/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["encoder/batch_normalization_3/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["encoder/batch_normalization_3/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["encoder/batch_normalization_2/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["encoder/batch_normalization_2/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["encoder/batch_normalization_1/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["encoder/batch_normalization_1/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2", "op": "Switch", "input": ["encoder/batch_normalization/beta", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1", "op": "Switch", "input": ["encoder/batch_normalization/gamma", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["encoder/batch_normalization/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["encoder/batch_normalization/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["encoder/batch_normalization_1/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["encoder/batch_normalization_1/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["encoder/batch_normalization_2/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["encoder/batch_normalization_2/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["encoder/batch_normalization_3/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["encoder/batch_normalization_3/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_4", "op": "Switch", "input": ["encoder/batch_normalization_4/moving_variance", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_3", "op": "Switch", "input": ["encoder/batch_normalization_4/moving_mean", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d/Conv2D", "op": "Conv2D", "input": ["encoder/Reshape", "encoder/conv2d/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "encoder/batch_normalization/cond/switch_t", "op": "Identity", "input": ["encoder/batch_normalization/cond/Switch:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "encoder/conv2d/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d/Conv2D", "encoder/conv2d/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/batch_normalization/cond/Const", "op": "Const", "input": ["^encoder/batch_normalization/cond/switch_t"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["encoder/conv2d/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization/cond/FusedBatchNorm_1/Switch:1", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1:1", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2:1", "encoder/batch_normalization/cond/Const", "encoder/batch_normalization/cond/Const"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization/cond/FusedBatchNorm_1/Switch", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_1", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_2", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_3", "encoder/batch_normalization/cond/FusedBatchNorm_1/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "encoder/batch_normalization/cond/Merge", "op": "Merge", "input": ["encoder/batch_normalization/cond/FusedBatchNorm_1", "encoder/batch_normalization/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "encoder/Relu", "op": "Relu", "input": ["encoder/batch_normalization/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_1/Conv2D", "op": "Conv2D", "input": ["encoder/Relu", "encoder/conv2d_1/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "encoder/conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_1/Conv2D", "encoder/conv2d_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["encoder/conv2d_1/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch:1", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1:1", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2:1", "encoder/batch_normalization/cond/Const", "encoder/batch_normalization/cond/Const"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_1/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_1", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_2", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_3", "encoder/batch_normalization_1/cond/FusedBatchNorm_1/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "encoder/batch_normalization_1/cond/Merge", "op": "Merge", "input": ["encoder/batch_normalization_1/cond/FusedBatchNorm_1", "encoder/batch_normalization_1/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "encoder/Relu_1", "op": "Relu", "input": ["encoder/batch_normalization_1/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_2/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_1", "encoder/conv2d_2/kernel"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "encoder/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_2/Conv2D", "encoder/conv2d_2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["encoder/conv2d_2/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch:1", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1:1", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2:1", "encoder/batch_normalization/cond/Const", "encoder/batch_normalization/cond/Const"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_2/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3", "encoder/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}}}, {"name": "encoder/batch_normalization_2/cond/Merge", "op": "Merge", "input": ["encoder/batch_normalization_2/cond/FusedBatchNorm_1", "encoder/batch_normalization_2/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "encoder/Relu_2", "op": "Relu", "input": ["encoder/batch_normalization_2/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_3/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_2", "encoder/conv2d_3/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "encoder/conv2d_3/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_3/Conv2D", "encoder/conv2d_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["encoder/conv2d_3/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch:1", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1:1", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2:1", "encoder/batch_normalization/cond/Const", "encoder/batch_normalization/cond/Const"], "attr": {"epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}}}, {"name": "encoder/batch_normalization_3/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_1", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_2", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_3", "encoder/batch_normalization_3/cond/FusedBatchNorm_1/Switch_4"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "encoder/batch_normalization_3/cond/Merge", "op": "Merge", "input": ["encoder/batch_normalization_3/cond/FusedBatchNorm_1", "encoder/batch_normalization_3/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "encoder/Relu_3", "op": "Relu", "input": ["encoder/batch_normalization_3/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/conv2d_4/Conv2D", "op": "Conv2D", "input": ["encoder/Relu_3", "encoder/conv2d_4/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "encoder/conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["encoder/conv2d_4/Conv2D", "encoder/conv2d_4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch", "op": "Switch", "input": ["encoder/conv2d_4/BiasAdd", "PlaceholderWithDefault_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch:1", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_1:1", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_2:1", "encoder/batch_normalization/cond/Const", "encoder/batch_normalization/cond/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "is_training": {"b": true}, "epsilon": {"f": 0.0010000000474974513}}}, {"name": "encoder/batch_normalization_4/cond/FusedBatchNorm_1", "op": "FusedBatchNorm", "input": ["encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_1", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_2", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_3", "encoder/batch_normalization_4/cond/FusedBatchNorm_1/Switch_4"], "attr": {"data_format": {"s": "TkhXQw=="}, "is_training": {"b": false}, "epsilon": {"f": 0.0010000000474974513}, "T": {"type": "DT_FLOAT"}}}, {"name": "encoder/batch_normalization_4/cond/Merge", "op": "Merge", "input": ["encoder/batch_normalization_4/cond/FusedBatchNorm_1", "encoder/batch_normalization_4/cond/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "encoder/Relu_4", "op": "Relu", "input": ["encoder/batch_normalization_4/cond/Merge"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/flatten/Shape", "op": "Shape", "input": ["encoder/Relu_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/strided_slice", "op": "StridedSlice", "input": ["encoder/flatten/Shape", "encoder/flatten/strided_slice/stack", "encoder/flatten/strided_slice/stack_1", "encoder/flatten/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "encoder/flatten/Reshape/shape", "op": "Pack", "input": ["encoder/flatten/strided_slice", "encoder/flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "encoder/flatten/Reshape", "op": "Reshape", "input": ["encoder/Relu_4", "encoder/flatten/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "encoder/dense/MatMul", "op": "MatMul", "input": ["encoder/flatten/Reshape", "encoder/dense/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "encoder/dense/BiasAdd", "op": "BiasAdd", "input": ["encoder/dense/MatMul", "encoder/dense/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "encoder/dense/Relu", "op": "Relu", "input": ["encoder/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "encoder/z_mean/MatMul", "op": "MatMul", "input": ["encoder/dense/Relu", "encoder/z_mean/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "encoder/z_mean/BiasAdd", "op": "BiasAdd", "input": ["encoder/z_mean/MatMul", "encoder/z_mean/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}], "library": {}, "versions": {"producer": 59}}, "weightsManifest": [{"paths": ["group1-shard1of14.bin", "group1-shard2of14.bin", "group1-shard3of14.bin", "group1-shard4of14.bin", "group1-shard5of14.bin", "group1-shard6of14.bin", "group1-shard7of14.bin", "group1-shard8of14.bin", "group1-shard9of14.bin", "group1-shard10of14.bin", "group1-shard11of14.bin", "group1-shard12of14.bin", "group1-shard13of14.bin", "group1-shard14of14.bin"], "weights": [{"name": "gmm/gmm_means/read", "shape": [4, 200], "dtype": "float32"}, {"name": "encoder/z_mean/bias", "shape": [200], "dtype": "float32"}, {"name": "encoder/z_mean/kernel", "shape": [2048, 200], "dtype": "float32"}, {"name": "encoder/dense/bias", "shape": [2048], "dtype": "float32"}, {"name": "encoder/dense/kernel", "shape": [3456, 2048], "dtype": "float32"}, {"name": "encoder/flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "encoder/flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "encoder/flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PlaceholderWithDefault_6/input", "shape": [], "dtype": "bool"}, {"name": "encoder/batch_normalization_4/beta", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization_4/gamma", "shape": [384], "dtype": "float32"}, {"name": "encoder/conv2d_4/bias", "shape": [384], "dtype": "float32"}, {"name": "encoder/conv2d_4/kernel", "shape": [5, 5, 384, 384], "dtype": "float32"}, {"name": "encoder/batch_normalization_3/beta", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization_3/gamma", "shape": [384], "dtype": "float32"}, {"name": "encoder/conv2d_3/bias", "shape": [384], "dtype": "float32"}, {"name": "encoder/conv2d_3/kernel", "shape": [5, 5, 192, 384], "dtype": "float32"}, {"name": "encoder/batch_normalization_2/beta", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "encoder/conv2d_2/bias", "shape": [192], "dtype": "float32"}, {"name": "encoder/conv2d_2/kernel", "shape": [5, 5, 192, 192], "dtype": "float32"}, {"name": "encoder/batch_normalization_1/beta", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "encoder/conv2d_1/bias", "shape": [192], "dtype": "float32"}, {"name": "encoder/conv2d_1/kernel", "shape": [5, 5, 96, 192], "dtype": "float32"}, {"name": "encoder/batch_normalization/beta", "shape": [96], "dtype": "float32"}, {"name": "encoder/batch_normalization/gamma", "shape": [96], "dtype": "float32"}, {"name": "encoder/conv2d/bias", "shape": [96], "dtype": "float32"}, {"name": "encoder/conv2d/kernel", "shape": [5, 5, 3, 96], "dtype": "float32"}, {"name": "encoder/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "encoder/batch_normalization/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "encoder/batch_normalization/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "encoder/batch_normalization_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "encoder/batch_normalization_3/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization_3/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization_4/moving_variance", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization_4/moving_mean", "shape": [384], "dtype": "float32"}, {"name": "encoder/batch_normalization/cond/Const", "shape": [0], "dtype": "float32"}]}]}